
==================
Using '@' in identifiers
==================

(@akollegger)
(akollegger@neo4j.com)

---

(source_file
  (pattern (node_pattern (node (identifier))))
  (pattern (node_pattern (node (identifier))))
)


==================
Using '_' and mixed case in identifiers
==================

(_0n96pdf6@E)
(Im0_pWk0g4@@)

---

(source_file
  (pattern (node_pattern (node (identifier))))
  (pattern (node_pattern (node (identifier))))
)


==================
Using numbers in identifiers
==================

(42)

---

(source_file
  (pattern (node_pattern (node (identifier))))
)


==================
Using numbers with units in identifiers
==================

(12px)

---

(source_file
  (pattern (node_pattern (node (identifier))))
)


==================
Using backtick delimited identifiers
==================

(`+1`)

---

(source_file
  (pattern (node_pattern (node (identifier))))
)


