==================
Hello world
==================

(hello)-->(world)

---

(source_file
  (pattern
    (part
      (node (attributes (symbol)))
      (single_arrow_right)
      (node (attributes (symbol)))
    )
  )
)

==================
Hello dear world
==================

(hello)-[dear]->(world)

---

(source_file
  (pattern
    (part
      (node (attributes (symbol)))
      (single_arrow_right (attributes (symbol)))
      (node (attributes (symbol)))
    )
  )
)

==================
Hello dear world over there
==================

(hello)-[dear]->(world)-[over]->(there)

---

(source_file
  (pattern
    (part
      (node (attributes (symbol)))
      (single_arrow_right (attributes (symbol)))
      (node (attributes (symbol)))
      (single_arrow_right (attributes (symbol)))
      (node (attributes (symbol)))
    )
  )
)

==================
Hello "dear world" "over there"
==================

(hello)-[`dear world`]->(`over there`)

---

(source_file
  (pattern
    (part
      (node (attributes (symbol)))
      (single_arrow_right (attributes (backticked_string)))
      (node (attributes (backticked_string)))
    )
  )
)
